Autodesk.Revit.DB.CustomFieldInformation.SetApplicableCategories(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Sets the category ids for which this field can be added to the schedule.
By default, this class doesn't store any applicable category ids.
applicableCategories:
The category ids for which this field can be added to the schedule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.CustomFieldInformation.GetApplicableCategories
Gets the category ids for which this field can be added to the schedule.
By default, this class doesn't store any applicable category ids.
Returns:
Returns the category ids for which this field can be added to the schedule.

Autodesk.Revit.DB.CustomFieldInformation.SetSpecTypeId(Autodesk.Revit.DB.ForgeTypeId)
Sets the spec describing the data type. Can be set only if the StorageType is Double.
The default value stored by this class is an empty ForgeTypeId.
specTypeId:
The spec describing the data type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a spec identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
To assign a spec StorageType is required to be Double.

Autodesk.Revit.DB.CustomFieldInformation.GetSpecTypeId
Gets the spec describing the data type.
Can be obtained only if the StorageType is Double.
The default value stored by this class is an empty ForgeTypeId.
Returns:
Returns the spec describing the data type.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
To assign a spec StorageType is required to be Double.

Autodesk.Revit.DB.CustomFieldInformation.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.CustomFieldInformation.DefaultVerticalAlignmentStyle
Identifies the default vertical alignment. This will be used only if Autodesk.Revit.DB.CustomFieldInformation.HasCustomGraphicRepresentationOnSheet is true.
The default value stored by this class is VerticalAlignmentStyle::Middle.

Autodesk.Revit.DB.CustomFieldInformation.DefaultHorizontalAlignmentStyle
Identifies the default horizontal alignment. This will be used only if Autodesk.Revit.DB.CustomFieldInformation.HasCustomGraphicRepresentationOnSheet is true.
The default value stored by this class is HorizontalAlignmentStyle::Center.

Autodesk.Revit.DB.CustomFieldInformation.FieldTooltip
The tooltip that will be shown in the schedule properties for this custom field.
The default value stored by this class is "".

Autodesk.Revit.DB.CustomFieldInformation.DefaultRowHeightOnSheet
The default row height of the custom field on the sheet, in feet. The default value stored by this class is 0.0.
If there is another field that has a bigger height, that one will be used.
This value will only be applied if Autodesk.Revit.DB.CustomFieldInformation.HasCustomGraphicRepresentationOnSheet is true.

Autodesk.Revit.DB.CustomFieldInformation.StorageType
The Storage Type of this field. It can be Integer, Double or String.
The default value stored by this class is String.

Autodesk.Revit.DB.CustomFieldInformation.HasCustomGraphicRepresentationOnSheet
Identifies if the field has a custom graphic representation when we have a schedule instance placed on the sheet or if its value will be shown as text.
The default value stored by this class is false.

Autodesk.Revit.DB.CustomFieldInformation.FieldName
Identifies the field name.
The default value stored by this class is "".

Autodesk.Revit.DB.CustomFieldInformation.#ctor
Constructs a new instance of a CustomFieldInformation.

Autodesk.Revit.DB.CustomFieldInformation
Class holding the general information about the custom field.